fixture/vcr_cassettes/Stripe.ChargeTest/change_with_key.json

[
  {
    "request": {
      "body": "amount=2000&currency=USD&source[object]=card&source[number]=4111111111111111&source[exp_month]=10&source[exp_year]=2020&source[country]=US&source[name]=Ducky Test&source[cvc]=123&description=1000+Widgets",
      "headers": {
        "Authorization": "Bearer qr0yuBikLRa5yJkMGuEO4DNblKhEJqkw",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/charges"
    },
    "response": {
      "body": "{\n  \"id\": \"ch_8qzWzsk3BuIpLW\",\n  \"object\": \"charge\",\n  \"amount\": 2000,\n  \"amount_refunded\": 0,\n  \"application_fee\": null,\n  \"balance_transaction\": \"txn_8qzWbMd9Oq5pnw\",\n  \"captured\": true,\n  \"created\": 1469008978,\n  \"currency\": \"usd\",\n  \"customer\": null,\n  \"description\": \"1000 Widgets\",\n  \"destination\": null,\n  \"dispute\": null,\n  \"failure_code\": null,\n  \"failure_message\": null,\n  \"fraud_details\": {},\n  \"invoice\": null,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"order\": null,\n  \"paid\": true,\n  \"receipt_email\": null,\n  \"receipt_number\": null,\n  \"refunded\": false,\n  \"refunds\": {\n    \"object\": \"list\",\n    \"data\": [],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/charges/ch_8qzWzsk3BuIpLW/refunds\"\n  },\n  \"shipping\": null,\n  \"source\": {\n    \"id\": \"card_8qzWPvVeHioftx\",\n    \"object\": \"card\",\n    \"address_city\": null,\n    \"address_country\": null,\n    \"address_line1\": null,\n    \"address_line1_check\": null,\n    \"address_line2\": null,\n    \"address_state\": null,\n    \"address_zip\": null,\n    \"address_zip_check\": null,\n    \"brand\": \"Visa\",\n    \"country\": \"US\",\n    \"customer\": null,\n    \"cvc_check\": \"pass\",\n    \"dynamic_last4\": null,\n    \"exp_month\": 10,\n    \"exp_year\": 2020,\n    \"fingerprint\": \"Ze2h9CyiqlKZzGuV\",\n    \"funding\": \"unknown\",\n    \"last4\": \"1111\",\n    \"metadata\": {},\n    \"name\": \"Ducky Test\",\n    \"tokenization_method\": null\n  },\n  \"source_transfer\": null,\n  \"statement_descriptor\": null,\n  \"status\": \"succeeded\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 10:02:59 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1448",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8qzWerIr7EyDnG",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "description=Changed+charge",
      "headers": {
        "Authorization": "Bearer qr0yuBikLRa5yJkMGuEO4DNblKhEJqkw",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/charges/ch_8qzWzsk3BuIpLW"
    },
    "response": {
      "body": "{\n  \"id\": \"ch_8qzWzsk3BuIpLW\",\n  \"object\": \"charge\",\n  \"amount\": 2000,\n  \"amount_refunded\": 0,\n  \"application_fee\": null,\n  \"balance_transaction\": \"txn_8qzWbMd9Oq5pnw\",\n  \"captured\": true,\n  \"created\": 1469008978,\n  \"currency\": \"usd\",\n  \"customer\": null,\n  \"description\": \"Changed charge\",\n  \"destination\": null,\n  \"dispute\": null,\n  \"failure_code\": null,\n  \"failure_message\": null,\n  \"fraud_details\": {},\n  \"invoice\": null,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"order\": null,\n  \"paid\": true,\n  \"receipt_email\": null,\n  \"receipt_number\": null,\n  \"refunded\": false,\n  \"refunds\": {\n    \"object\": \"list\",\n    \"data\": [],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/charges/ch_8qzWzsk3BuIpLW/refunds\"\n  },\n  \"shipping\": null,\n  \"source\": {\n    \"id\": \"card_8qzWPvVeHioftx\",\n    \"object\": \"card\",\n    \"address_city\": null,\n    \"address_country\": null,\n    \"address_line1\": null,\n    \"address_line1_check\": null,\n    \"address_line2\": null,\n    \"address_state\": null,\n    \"address_zip\": null,\n    \"address_zip_check\": null,\n    \"brand\": \"Visa\",\n    \"country\": \"US\",\n    \"customer\": null,\n    \"cvc_check\": \"pass\",\n    \"dynamic_last4\": null,\n    \"exp_month\": 10,\n    \"exp_year\": 2020,\n    \"fingerprint\": \"Ze2h9CyiqlKZzGuV\",\n    \"funding\": \"unknown\",\n    \"last4\": \"1111\",\n    \"metadata\": {},\n    \"name\": \"Ducky Test\",\n    \"tokenization_method\": null\n  },\n  \"source_transfer\": null,\n  \"statement_descriptor\": null,\n  \"status\": \"succeeded\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 10:02:59 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1450",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8qzWvfaldnPA7H",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]