fixture/vcr_cassettes/charge_test/get_with_key.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/charges?limit=1"
    },
    "response": {
      "body": "{\n  \"object\": \"list\",\n  \"data\": [\n    {\n      \"id\": \"ch_8r2jET3DYeL2Xv\",\n      \"object\": \"charge\",\n      \"amount\": 1000,\n      \"amount_refunded\": 0,\n      \"application_fee\": null,\n      \"balance_transaction\": \"txn_8r2jOkra0gnRpt\",\n      \"captured\": true,\n      \"created\": 1469020936,\n      \"currency\": \"usd\",\n      \"customer\": null,\n      \"description\": \"1000 Widgets\",\n      \"destination\": null,\n      \"dispute\": null,\n      \"failure_code\": null,\n      \"failure_message\": null,\n      \"fraud_details\": {},\n      \"invoice\": null,\n      \"livemode\": false,\n      \"metadata\": {},\n      \"order\": null,\n      \"paid\": true,\n      \"receipt_email\": null,\n      \"receipt_number\": null,\n      \"refunded\": false,\n      \"refunds\": {\n        \"object\": \"list\",\n        \"data\": [],\n        \"has_more\": false,\n        \"total_count\": 0,\n        \"url\": \"/v1/charges/ch_8r2jET3DYeL2Xv/refunds\"\n      },\n      \"shipping\": null,\n      \"source\": {\n        \"id\": \"card_8r2j3BBKBs6c2P\",\n        \"object\": \"card\",\n        \"address_city\": null,\n        \"address_country\": null,\n        \"address_line1\": null,\n        \"address_line1_check\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": null,\n        \"brand\": \"Visa\",\n        \"country\": \"US\",\n        \"customer\": null,\n        \"cvc_check\": \"pass\",\n        \"dynamic_last4\": null,\n        \"exp_month\": 10,\n        \"exp_year\": 2020,\n        \"fingerprint\": \"Ze2h9CyiqlKZzGuV\",\n        \"funding\": \"unknown\",\n        \"last4\": \"1111\",\n        \"metadata\": {},\n        \"name\": \"Ducky Test\",\n        \"tokenization_method\": null\n      },\n      \"source_transfer\": null,\n      \"statement_descriptor\": null,\n      \"status\": \"succeeded\"\n    }\n  ],\n  \"has_more\": true,\n  \"url\": \"/v1/charges\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:22:20 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1780",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2jdlH4eb3PXQ",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/charges/ch_8r2jET3DYeL2Xv"
    },
    "response": {
      "body": "{\n  \"id\": \"ch_8r2jET3DYeL2Xv\",\n  \"object\": \"charge\",\n  \"amount\": 1000,\n  \"amount_refunded\": 0,\n  \"application_fee\": null,\n  \"balance_transaction\": \"txn_8r2jOkra0gnRpt\",\n  \"captured\": true,\n  \"created\": 1469020936,\n  \"currency\": \"usd\",\n  \"customer\": null,\n  \"description\": \"1000 Widgets\",\n  \"destination\": null,\n  \"dispute\": null,\n  \"failure_code\": null,\n  \"failure_message\": null,\n  \"fraud_details\": {},\n  \"invoice\": null,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"order\": null,\n  \"paid\": true,\n  \"receipt_email\": null,\n  \"receipt_number\": null,\n  \"refunded\": false,\n  \"refunds\": {\n    \"object\": \"list\",\n    \"data\": [],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/charges/ch_8r2jET3DYeL2Xv/refunds\"\n  },\n  \"shipping\": null,\n  \"source\": {\n    \"id\": \"card_8r2j3BBKBs6c2P\",\n    \"object\": \"card\",\n    \"address_city\": null,\n    \"address_country\": null,\n    \"address_line1\": null,\n    \"address_line1_check\": null,\n    \"address_line2\": null,\n    \"address_state\": null,\n    \"address_zip\": null,\n    \"address_zip_check\": null,\n    \"brand\": \"Visa\",\n    \"country\": \"US\",\n    \"customer\": null,\n    \"cvc_check\": \"pass\",\n    \"dynamic_last4\": null,\n    \"exp_month\": 10,\n    \"exp_year\": 2020,\n    \"fingerprint\": \"Ze2h9CyiqlKZzGuV\",\n    \"funding\": \"unknown\",\n    \"last4\": \"1111\",\n    \"metadata\": {},\n    \"name\": \"Ducky Test\",\n    \"tokenization_method\": null\n  },\n  \"source_transfer\": null,\n  \"statement_descriptor\": null,\n  \"status\": \"succeeded\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:22:20 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1448",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2kSRfJhioeXg",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
