fixture/vcr_cassettes/invoices_test/change_with_key.json

[
  {
    "request": {
      "body": "description=Some+description&closed=true",
      "headers": {
        "Authorization": "Bearer STRIPE_SECRET_KEY",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/invoices/in_1Ac79wCM35SG8uZjktE8OgYt"
    },
    "response": {
      "body": "{\n  \"id\": \"in_1Ac79wCM35SG8uZjktE8OgYt\",\n  \"object\": \"invoice\",\n  \"amount_due\": 10,\n  \"application_fee\": null,\n  \"attempt_count\": 0,\n  \"attempted\": false,\n  \"charge\": null,\n  \"closed\": true,\n  \"currency\": \"usd\",\n  \"customer\": \"cus_Ay3GqeMIz0WkEm\",\n  \"date\": 1499236728,\n  \"description\": \"Some description\",\n  \"discount\": null,\n  \"ending_balance\": null,\n  \"forgiven\": false,\n  \"lines\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\": \"ii_1Ac79wCM35SG8uZjg219Etgu\",\n        \"object\": \"line_item\",\n        \"amount\": 10,\n        \"currency\": \"usd\",\n        \"description\": null,\n        \"discountable\": true,\n        \"livemode\": false,\n        \"metadata\": {},\n        \"period\": {\n          \"start\": 1499236728,\n          \"end\": 1499236728\n        },\n        \"plan\": null,\n        \"proration\": false,\n        \"quantity\": null,\n        \"subscription\": \"sub_Ay3GDAbPurf2VP\",\n        \"type\": \"invoiceitem\"\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\": 1,\n    \"url\": \"/v1/invoices/in_1Ac79wCM35SG8uZjktE8OgYt/lines\"\n  },\n  \"livemode\": false,\n  \"metadata\": {\n    \"app_order_id\": \"ABC1234\",\n    \"app_attr1\": \"xyz1\"\n  },\n  \"next_payment_attempt\": null,\n  \"paid\": false,\n  \"period_end\": 1499236728,\n  \"period_start\": 1499236727,\n  \"receipt_number\": null,\n  \"starting_balance\": 0,\n  \"statement_descriptor\": null,\n  \"subscription\": \"sub_Ay3GDAbPurf2VP\",\n  \"subtotal\": 10,\n  \"tax\": null,\n  \"tax_percent\": null,\n  \"total\": 10,\n  \"webhooks_delivered_at\": 1499236728\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 05 Jul 2017 06:38:54 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1471",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_Ay3GHpvn2KCuEW",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]