fixture/vcr_cassettes/invoices_test/metadata.json

[
  {
    "request": {
      "body": "customer=cus_Ay3G4eTAX3FgXd&subscription=sub_Ay3GRYIf5J5VBt&metadata[app_order_id]=ABC123&metadata[app_attr1]=xyz",
      "headers": {
        "Authorization": "Bearer STRIPE_SECRET_KEY",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/invoices"
    },
    "response": {
      "body": "{\n  \"id\": \"in_1Ac79xCM35SG8uZj5FxDwLZH\",\n  \"object\": \"invoice\",\n  \"amount_due\": 10,\n  \"application_fee\": null,\n  \"attempt_count\": 0,\n  \"attempted\": false,\n  \"charge\": null,\n  \"closed\": false,\n  \"currency\": \"usd\",\n  \"customer\": \"cus_Ay3G4eTAX3FgXd\",\n  \"date\": 1499236729,\n  \"description\": null,\n  \"discount\": null,\n  \"ending_balance\": null,\n  \"forgiven\": false,\n  \"lines\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\": \"ii_1Ac79uCM35SG8uZjpj88VkZX\",\n        \"object\": \"line_item\",\n        \"amount\": 10,\n        \"currency\": \"usd\",\n        \"description\": null,\n        \"discountable\": true,\n        \"livemode\": false,\n        \"metadata\": {},\n        \"period\": {\n          \"start\": 1499236726,\n          \"end\": 1499236726\n        },\n        \"plan\": null,\n        \"proration\": false,\n        \"quantity\": null,\n        \"subscription\": \"sub_Ay3GRYIf5J5VBt\",\n        \"type\": \"invoiceitem\"\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\": 1,\n    \"url\": \"/v1/invoices/in_1Ac79xCM35SG8uZj5FxDwLZH/lines\"\n  },\n  \"livemode\": false,\n  \"metadata\": {\n    \"app_order_id\": \"ABC123\",\n    \"app_attr1\": \"xyz\"\n  },\n  \"next_payment_attempt\": 1499240329,\n  \"paid\": false,\n  \"period_end\": 1499236729,\n  \"period_start\": 1499236725,\n  \"receipt_number\": null,\n  \"starting_balance\": 0,\n  \"statement_descriptor\": null,\n  \"subscription\": \"sub_Ay3GRYIf5J5VBt\",\n  \"subtotal\": 10,\n  \"tax\": null,\n  \"tax_percent\": null,\n  \"total\": 10,\n  \"webhooks_delivered_at\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 05 Jul 2017 06:38:49 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1456",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_Ay3GJVxOOUjn60",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]