fixture/vcr_cassettes/invoices_test/setup.json

[
  {
    "request": {
      "body": "currency=USD&id=test-std&name=Test+Plan+Standard&amount=100&interval=month",
      "headers": {
        "Authorization": "Bearer STRIPE_SECRET_KEY",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/plans"
    },
    "response": {
      "body": "{\n  \"id\": \"test-std\",\n  \"object\": \"plan\",\n  \"amount\": 100,\n  \"created\": 1499236723,\n  \"currency\": \"usd\",\n  \"interval\": \"month\",\n  \"interval_count\": 1,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"name\": \"Test Plan Standard\",\n  \"statement_descriptor\": null,\n  \"trial_period_days\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 05 Jul 2017 06:38:43 GMT",
        "Content-Type": "application/json",
        "Content-Length": "284",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_Ay3GzhnUOgNfcJ",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "currency=USD&id=test-dlx&name=Test+Plan+Deluxe&amount=1000&interval=month",
      "headers": {
        "Authorization": "Bearer STRIPE_SECRET_KEY",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/plans"
    },
    "response": {
      "body": "{\n  \"id\": \"test-dlx\",\n  \"object\": \"plan\",\n  \"amount\": 1000,\n  \"created\": 1499236724,\n  \"currency\": \"usd\",\n  \"interval\": \"month\",\n  \"interval_count\": 1,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"name\": \"Test Plan Deluxe\",\n  \"statement_descriptor\": null,\n  \"trial_period_days\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 05 Jul 2017 06:38:44 GMT",
        "Content-Type": "application/json",
        "Content-Length": "283",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_Ay3GvpFs95IFOt",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "email=invoices_test1%40localhost&description=Test+Account&card[number]=4111111111111111&card[exp_month]=1&card[exp_year]=2018&card[cvc]=123&card[name]=Joe+Test+User",
      "headers": {
        "Authorization": "Bearer STRIPE_SECRET_KEY",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers"
    },
    "response": {
      "body": "{\n  \"id\": \"cus_Ay3G4eTAX3FgXd\",\n  \"object\": \"customer\",\n  \"account_balance\": 0,\n  \"created\": 1499236724,\n  \"currency\": null,\n  \"default_source\": \"card_1Ac79sCM35SG8uZjRkWGg9Z9\",\n  \"delinquent\": false,\n  \"description\": \"Test Account\",\n  \"discount\": null,\n  \"email\": \"invoices_test1@localhost\",\n  \"livemode\": false,\n  \"metadata\": {},\n  \"shipping\": null,\n  \"sources\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\": \"card_1Ac79sCM35SG8uZjRkWGg9Z9\",\n        \"object\": \"card\",\n        \"address_city\": null,\n        \"address_country\": null,\n        \"address_line1\": null,\n        \"address_line1_check\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": null,\n        \"brand\": \"Visa\",\n        \"country\": \"US\",\n        \"customer\": \"cus_Ay3G4eTAX3FgXd\",\n        \"cvc_check\": \"pass\",\n        \"dynamic_last4\": null,\n        \"exp_month\": 1,\n        \"exp_year\": 2018,\n        \"fingerprint\": \"KTWhNpFM0faAWygq\",\n        \"funding\": \"unknown\",\n        \"last4\": \"1111\",\n        \"metadata\": {},\n        \"name\": \"Joe Test User\",\n        \"tokenization_method\": null\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\": 1,\n    \"url\": \"/v1/customers/cus_Ay3G4eTAX3FgXd/sources\"\n  },\n  \"subscriptions\": {\n    \"object\": \"list\",\n    \"data\": [],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_Ay3G4eTAX3FgXd/subscriptions\"\n  }\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 05 Jul 2017 06:38:44 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1423",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_Ay3GV5BkvIXbmf",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "plan=test-std",
      "headers": {
        "Authorization": "Bearer STRIPE_SECRET_KEY",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_Ay3G4eTAX3FgXd/subscriptions"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_Ay3GRYIf5J5VBt\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\": null,\n  \"created\": 1499236725,\n  \"current_period_end\": 1501915125,\n  \"current_period_start\": 1499236725,\n  \"customer\": \"cus_Ay3G4eTAX3FgXd\",\n  \"discount\": null,\n  \"ended_at\": null,\n  \"items\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\": \"si_1Ac79tCM35SG8uZjJW619dXs\",\n        \"object\": \"subscription_item\",\n        \"created\": 1499236725,\n        \"plan\": {\n          \"id\": \"test-std\",\n          \"object\": \"plan\",\n          \"amount\": 100,\n          \"created\": 1499236723,\n          \"currency\": \"usd\",\n          \"interval\": \"month\",\n          \"interval_count\": 1,\n          \"livemode\": false,\n          \"metadata\": {},\n          \"name\": \"Test Plan Standard\",\n          \"statement_descriptor\": null,\n          \"trial_period_days\": null\n        },\n        \"quantity\": 1\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\": 1,\n    \"url\": \"/v1/subscription_items?subscription=sub_Ay3GRYIf5J5VBt\"\n  },\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-std\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1499236723,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan Standard\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1499236725,\n  \"status\": \"active\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 05 Jul 2017 06:38:45 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1548",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_Ay3GWOLIliQszt",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "customer=cus_Ay3G4eTAX3FgXd&amount=10&currency=usd&subscription=sub_Ay3GRYIf5J5VBt",
      "headers": {
        "Authorization": "Bearer STRIPE_SECRET_KEY",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/invoiceitems"
    },
    "response": {
      "body": "{\n  \"id\": \"ii_1Ac79uCM35SG8uZjpj88VkZX\",\n  \"object\": \"invoiceitem\",\n  \"amount\": 10,\n  \"currency\": \"usd\",\n  \"customer\": \"cus_Ay3G4eTAX3FgXd\",\n  \"date\": 1499236726,\n  \"description\": null,\n  \"discountable\": true,\n  \"invoice\": null,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"period\": {\n    \"start\": 1499236726,\n    \"end\": 1499236726\n  },\n  \"plan\": null,\n  \"proration\": false,\n  \"quantity\": null,\n  \"subscription\": \"sub_Ay3GRYIf5J5VBt\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 05 Jul 2017 06:38:46 GMT",
        "Content-Type": "application/json",
        "Content-Length": "433",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_Ay3GZJM9uoK7PD",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "email=invoices_test2%40localhost&description=Test+Account&card[number]=4111111111111111&card[exp_month]=1&card[exp_year]=2018&card[cvc]=123&card[name]=Joe+Test+User",
      "headers": {
        "Authorization": "Bearer STRIPE_SECRET_KEY",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers"
    },
    "response": {
      "body": "{\n  \"id\": \"cus_Ay3GqeMIz0WkEm\",\n  \"object\": \"customer\",\n  \"account_balance\": 0,\n  \"created\": 1499236726,\n  \"currency\": null,\n  \"default_source\": \"card_1Ac79uCM35SG8uZjRucyPQvx\",\n  \"delinquent\": false,\n  \"description\": \"Test Account\",\n  \"discount\": null,\n  \"email\": \"invoices_test2@localhost\",\n  \"livemode\": false,\n  \"metadata\": {},\n  \"shipping\": null,\n  \"sources\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\": \"card_1Ac79uCM35SG8uZjRucyPQvx\",\n        \"object\": \"card\",\n        \"address_city\": null,\n        \"address_country\": null,\n        \"address_line1\": null,\n        \"address_line1_check\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": null,\n        \"brand\": \"Visa\",\n        \"country\": \"US\",\n        \"customer\": \"cus_Ay3GqeMIz0WkEm\",\n        \"cvc_check\": \"pass\",\n        \"dynamic_last4\": null,\n        \"exp_month\": 1,\n        \"exp_year\": 2018,\n        \"fingerprint\": \"KTWhNpFM0faAWygq\",\n        \"funding\": \"unknown\",\n        \"last4\": \"1111\",\n        \"metadata\": {},\n        \"name\": \"Joe Test User\",\n        \"tokenization_method\": null\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\": 1,\n    \"url\": \"/v1/customers/cus_Ay3GqeMIz0WkEm/sources\"\n  },\n  \"subscriptions\": {\n    \"object\": \"list\",\n    \"data\": [],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_Ay3GqeMIz0WkEm/subscriptions\"\n  }\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 05 Jul 2017 06:38:46 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1423",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_Ay3GCtDFhaWV5Z",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "plan=test-std",
      "headers": {
        "Authorization": "Bearer STRIPE_SECRET_KEY",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_Ay3GqeMIz0WkEm/subscriptions"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_Ay3GDAbPurf2VP\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\": null,\n  \"created\": 1499236727,\n  \"current_period_end\": 1501915127,\n  \"current_period_start\": 1499236727,\n  \"customer\": \"cus_Ay3GqeMIz0WkEm\",\n  \"discount\": null,\n  \"ended_at\": null,\n  \"items\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\": \"si_1Ac79vCM35SG8uZjMlydqV20\",\n        \"object\": \"subscription_item\",\n        \"created\": 1499236727,\n        \"plan\": {\n          \"id\": \"test-std\",\n          \"object\": \"plan\",\n          \"amount\": 100,\n          \"created\": 1499236723,\n          \"currency\": \"usd\",\n          \"interval\": \"month\",\n          \"interval_count\": 1,\n          \"livemode\": false,\n          \"metadata\": {},\n          \"name\": \"Test Plan Standard\",\n          \"statement_descriptor\": null,\n          \"trial_period_days\": null\n        },\n        \"quantity\": 1\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\": 1,\n    \"url\": \"/v1/subscription_items?subscription=sub_Ay3GDAbPurf2VP\"\n  },\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-std\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1499236723,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan Standard\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1499236727,\n  \"status\": \"active\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 05 Jul 2017 06:38:47 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1548",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_Ay3GLQ5B4y7y3C",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "customer=cus_Ay3GqeMIz0WkEm&amount=10&currency=usd&subscription=sub_Ay3GDAbPurf2VP",
      "headers": {
        "Authorization": "Bearer STRIPE_SECRET_KEY",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/invoiceitems"
    },
    "response": {
      "body": "{\n  \"id\": \"ii_1Ac79wCM35SG8uZjg219Etgu\",\n  \"object\": \"invoiceitem\",\n  \"amount\": 10,\n  \"currency\": \"usd\",\n  \"customer\": \"cus_Ay3GqeMIz0WkEm\",\n  \"date\": 1499236728,\n  \"description\": null,\n  \"discountable\": true,\n  \"invoice\": null,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"period\": {\n    \"start\": 1499236728,\n    \"end\": 1499236728\n  },\n  \"plan\": null,\n  \"proration\": false,\n  \"quantity\": null,\n  \"subscription\": \"sub_Ay3GDAbPurf2VP\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 05 Jul 2017 06:38:48 GMT",
        "Content-Type": "application/json",
        "Content-Length": "433",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_Ay3GBrWEx8nhHl",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "customer=cus_Ay3GqeMIz0WkEm&subscription=sub_Ay3GDAbPurf2VP&metadata[app_order_id]=ABC1234&metadata[app_attr1]=xyz1",
      "headers": {
        "Authorization": "Bearer STRIPE_SECRET_KEY",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/invoices"
    },
    "response": {
      "body": "{\n  \"id\": \"in_1Ac79wCM35SG8uZjktE8OgYt\",\n  \"object\": \"invoice\",\n  \"amount_due\": 10,\n  \"application_fee\": null,\n  \"attempt_count\": 0,\n  \"attempted\": false,\n  \"charge\": null,\n  \"closed\": false,\n  \"currency\": \"usd\",\n  \"customer\": \"cus_Ay3GqeMIz0WkEm\",\n  \"date\": 1499236728,\n  \"description\": null,\n  \"discount\": null,\n  \"ending_balance\": null,\n  \"forgiven\": false,\n  \"lines\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\": \"ii_1Ac79wCM35SG8uZjg219Etgu\",\n        \"object\": \"line_item\",\n        \"amount\": 10,\n        \"currency\": \"usd\",\n        \"description\": null,\n        \"discountable\": true,\n        \"livemode\": false,\n        \"metadata\": {},\n        \"period\": {\n          \"start\": 1499236728,\n          \"end\": 1499236728\n        },\n        \"plan\": null,\n        \"proration\": false,\n        \"quantity\": null,\n        \"subscription\": \"sub_Ay3GDAbPurf2VP\",\n        \"type\": \"invoiceitem\"\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\": 1,\n    \"url\": \"/v1/invoices/in_1Ac79wCM35SG8uZjktE8OgYt/lines\"\n  },\n  \"livemode\": false,\n  \"metadata\": {\n    \"app_order_id\": \"ABC1234\",\n    \"app_attr1\": \"xyz1\"\n  },\n  \"next_payment_attempt\": 1499240328,\n  \"paid\": false,\n  \"period_end\": 1499236728,\n  \"period_start\": 1499236727,\n  \"receipt_number\": null,\n  \"starting_balance\": 0,\n  \"statement_descriptor\": null,\n  \"subscription\": \"sub_Ay3GDAbPurf2VP\",\n  \"subtotal\": 10,\n  \"tax\": null,\n  \"tax_percent\": null,\n  \"total\": 10,\n  \"webhooks_delivered_at\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 05 Jul 2017 06:38:48 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1458",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_Ay3GbzRK2b0L0e",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]