fixture/vcr_cassettes/invoices_test/teardown.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "delete",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8r2jCf6wk8YLyU/subscriptions/sub_8r2j78r42DD6xb"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_8r2j78r42DD6xb\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\": 1469020934,\n  \"created\": 1469020924,\n  \"current_period_end\": 1471699324,\n  \"current_period_start\": 1469020924,\n  \"customer\": \"cus_8r2jCf6wk8YLyU\",\n  \"discount\": null,\n  \"ended_at\": 1469020934,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-std\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1469020923,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan Standard\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1469020924,\n  \"status\": \"canceled\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:22:14 GMT",
        "Content-Type": "application/json",
        "Content-Length": "830",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2jDwEyECrNId",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "delete",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8r2jCf6wk8YLyU"
    },
    "response": {
      "body": "{\n  \"deleted\": true,\n  \"id\": \"cus_8r2jCf6wk8YLyU\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:22:15 GMT",
        "Content-Type": "application/json",
        "Content-Length": "52",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2jEL8kcBQ1PG",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "delete",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/plans/test-std"
    },
    "response": {
      "body": "{\n  \"deleted\": true,\n  \"id\": \"test-std\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:22:15 GMT",
        "Content-Type": "application/json",
        "Content-Length": "42",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2jRFJ5YTfxR1",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "delete",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/plans/test-dlx"
    },
    "response": {
      "body": "{\n  \"deleted\": true,\n  \"id\": \"test-dlx\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:22:15 GMT",
        "Content-Type": "application/json",
        "Content-Length": "42",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2jvHtTAISYVR",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
