fixture/vcr_cassettes/invoices_test/upcoming_with_key.json

[
  {
    "request": {
      "body": "customer=cus_Ay3G4eTAX3FgXd",
      "headers": {
        "Authorization": "Bearer STRIPE_SECRET_KEY",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/invoices/upcoming"
    },
    "response": {
      "body": "{\n  \"object\": \"invoice\",\n  \"amount_due\": 100,\n  \"application_fee\": null,\n  \"attempt_count\": 0,\n  \"attempted\": false,\n  \"charge\": null,\n  \"closed\": false,\n  \"currency\": \"usd\",\n  \"customer\": \"cus_Ay3G4eTAX3FgXd\",\n  \"date\": 1501915125,\n  \"description\": null,\n  \"discount\": null,\n  \"ending_balance\": null,\n  \"forgiven\": false,\n  \"lines\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\": \"sub_Ay3GRYIf5J5VBt\",\n        \"object\": \"line_item\",\n        \"amount\": 100,\n        \"currency\": \"usd\",\n        \"description\": null,\n        \"discountable\": true,\n        \"livemode\": false,\n        \"metadata\": {},\n        \"period\": {\n          \"start\": 1501915125,\n          \"end\": 1504593525\n        },\n        \"plan\": {\n          \"id\": \"test-std\",\n          \"object\": \"plan\",\n          \"amount\": 100,\n          \"created\": 1499236723,\n          \"currency\": \"usd\",\n          \"interval\": \"month\",\n          \"interval_count\": 1,\n          \"livemode\": false,\n          \"metadata\": {},\n          \"name\": \"Test Plan Standard\",\n          \"statement_descriptor\": null,\n          \"trial_period_days\": null\n        },\n        \"proration\": false,\n        \"quantity\": 1,\n        \"subscription\": null,\n        \"subscription_item\": \"si_1Ac79tCM35SG8uZjJW619dXs\",\n        \"type\": \"subscription\"\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\": 1,\n    \"url\": \"/v1/invoices/upcoming/lines?customer=cus_Ay3G4eTAX3FgXd\"\n  },\n  \"livemode\": false,\n  \"metadata\": {},\n  \"next_payment_attempt\": 1501918725,\n  \"paid\": false,\n  \"period_end\": 1501915125,\n  \"period_start\": 1499236725,\n  \"receipt_number\": null,\n  \"starting_balance\": 0,\n  \"statement_descriptor\": null,\n  \"subscription\": \"sub_Ay3GRYIf5J5VBt\",\n  \"subtotal\": 100,\n  \"tax\": null,\n  \"tax_percent\": null,\n  \"total\": 100,\n  \"webhooks_delivered_at\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 05 Jul 2017 06:38:51 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1790",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_Ay3G8MYwbfHR0E",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]